; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v4)
             (pred_8 ?v1 ?v2)
             (pred_11 ?v13 ?v2)
             (pred_4 ?v11 ?v13 )
	     (pred_6 ?v13)
             (pred_12 ?v5)
             (pred_1 ?v1)
             (pred_2 ?v2)
             (pred_10 ?v13)
             (pred_9 ?v1)
             (pred_5 ?v13)
             (pred_3 ))



(:action op_4
:parameters (?v3 ?v6 ?v9 ?v8)
:precondition (and (pred_12 ?v3) (pred_12 ?v6) (pred_1 ?v9) (pred_2 ?v8)
          (pred_7 ?v3 ?v6) (pred_8 ?v9 ?v8)
                   (pred_11 ?v6 ?v8) (pred_6 ?v3) 
                   (pred_10 ?v6) (pred_9 ?v9))
:effect (and  (pred_5 ?v6) (not (pred_10 ?v6))))


(:action op_2
:parameters (?v3 ?v10)
:precondition (and (pred_12 ?v3) (pred_12 ?v10)
               (pred_6 ?v3) (pred_7 ?v3 ?v10) (pred_5 ?v10))
:effect (and (pred_6 ?v10) (not (pred_6 ?v3))))

(:action op_5
:parameters (?v3 ?v9)
:precondition (and (pred_12 ?v3) (pred_1 ?v9) 
                  (pred_6 ?v3) (pred_4 ?v9 ?v3) (pred_3 ))
:effect (and (pred_9 ?v9)
   (not (pred_4 ?v9 ?v3)) (not (pred_3 ))))


(:action op_1
:parameters (?v3 ?v12 ?v7)
:precondition (and (pred_12 ?v3) (pred_1 ?v12) (pred_1 ?v7)
                  (pred_6 ?v3) (pred_9 ?v7) (pred_4 ?v12 ?v3))
:effect (and (pred_9 ?v12) (pred_4 ?v7 ?v3)
        (not (pred_9 ?v7)) (not (pred_4 ?v12 ?v3))))

(:action op_3
:parameters (?v3 ?v9)
:precondition (and (pred_12 ?v3) (pred_1 ?v9) 
                  (pred_6 ?v3) (pred_9 ?v9))
:effect (and (pred_3 ) (pred_4 ?v9 ?v3) (not (pred_9 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_16 obj_19 obj_17 obj_08 obj_02 obj_03 obj_14 obj_01 obj_11 obj_04 obj_06 obj_20 obj_07 obj_05 obj_10
    obj_09 obj_15
    obj_18 obj_13
    )

    (:init
       (pred_3)

       (pred_12 obj_12)
       (pred_12 obj_16)
       (pred_12 obj_19)
       (pred_12 obj_17)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_14)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_10)
       (pred_2 obj_09)
       (pred_2 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_13)

       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_16)
       (pred_7 obj_16 obj_02)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_16 obj_12)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_17 obj_14)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_08 obj_02)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_02 obj_11)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_16)
       (pred_7 obj_02 obj_08)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_17)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_01 obj_20)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_02)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_04 obj_06)
       (pred_7 obj_04 obj_03)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_04)
       (pred_7 obj_20 obj_07)
       (pred_7 obj_20 obj_01)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_07 obj_20)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_08)
       (pred_11  obj_01 obj_09)
       (pred_11  obj_08 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_16)
       (pred_5 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_14)
       (pred_5 obj_11)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_10)

       (pred_8  obj_18 obj_09)
       (pred_8  obj_13 obj_15)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_13 obj_12)
       (pred_6 obj_07)
    )

    (:goal (and
       (pred_4 obj_13 obj_16)
    ))
(:constraints
  (always (not (pred_6 obj_11)))
)
)

; plan
1. (op_2 obj_07 obj_05)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_05)
   goals met: 0 of 1
2. (op_2 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 0 of 1
3. (op_2 obj_04 obj_03)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_03)
   goals met: 0 of 1
4. (op_2 obj_03 obj_19)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_19)
   goals met: 0 of 1
5. (op_2 obj_19 obj_16)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_2 obj_16 obj_12)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_12)
   goals met: 0 of 1
7. (op_5 obj_12 obj_13)
   deleted: (pred_4 obj_13 obj_12) (pred_3)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_2 obj_12 obj_16)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_16)
   goals met: 0 of 1
9. (op_3 obj_16 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_3) (pred_4 obj_13 obj_16)
   goals met: 1 of 1
